Конфигурация/InformationRegisters/НастройкиФормированияСЧА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>НастройкиФормированияСЧА</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПериодичностьРасчетаСЧА</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиРегламентныхДействий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьРасчетныйКупон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НКДВСправедливойСтоимостиЦБ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантРасчетаПроцентовПоСделкамРЕПО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРасчетаПроцентовПоСделкамРЕПО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТочностьРасчетнойСтавкиРЕПО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КритерийСущественностиОтклоненияССТПлюс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьНастройкиУчетнойПолитикиЕПС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьНачисленияРезервов</Name>
					<Comment>#538027</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьПереоценкиАктивов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КорзинаОФЗПК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КорзиныОФЗПК</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПриостановленРасчетСЧА</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ВариантыРасчетаПроцентовПоСделкамРЕПО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВариантыРасчетаПроцентовПоСделкамРЕПО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоСтавкеОтПервойЧастиРЕПО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоРавномерномуРаспределениюПоДням</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоРасчетнойСтавке</Name>
					<Comment>Газфонд</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/InformationRegisters/НастройкиФормированияСЧА/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область События_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Запись.СчетДоверительногоУправления) Тогда
		
		ЭтаФорма.ВидДоговораДоверительногоУправления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
					Запись.СчетДоверительногоУправления,
					"ВидДоговораДоверительногоУправления");
					
	КонецЕсли;
				
	Если Запись.ИсходныйКлючЗаписи.Пустой()	
		И ЭтаФорма.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеСобственнымиСредствамиПенсионныхФондов
		Тогда
		
			Запись.ИспользоватьНастройкиУчетнойПолитикиЕПС 	= Истина;
			Запись.ВариантРасчетаПроцентовПоСделкамРЕПО 	= Неопределено;
			Запись.КритерийСущественностиОтклоненияССТПлюс 	= 0;
			Запись.ТочностьРасчетнойСтавкиРЕПО 				= 0;
			
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры  

#КонецОбласти

#Область События_элементов_формы

&НаКлиенте
Процедура ВариантРасчетаПроцентовПоСделкамРЕПОПриИзменении(Элемент)
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	РаботаСФормамиКлиентСервер.ОчиститьЗначенияСкрытыхПолей(ЭтаФорма, Новый Структура("ТочностьРасчетнойСтавкиРЕПО", "Запись.ТочностьРасчетнойСтавкиРЕПО"));
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьНастройкиУчетнойПолитикиЕПСПриИзменении(Элемент)
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	МассивРеквизитовДляОчистки = Новый Массив;
	МассивРеквизитовДляОчистки.Добавить("Запись.ВариантРасчетаПроцентовПоСделкамРЕПО");
	МассивРеквизитовДляОчистки.Добавить("Запись.ТочностьРасчетнойСтавкиРЕПО");
	МассивРеквизитовДляОчистки.Добавить("Запись.КритерийСущественностиОтклоненияССТПлюс");
	
	РаботаСФормамиКлиентСервер.ОчиститьЗначенияСкрытыхПолей(ЭтаФорма, Новый Структура("ГруппаРЕПО", МассивРеквизитовДляОчистки));
	
КонецПроцедуры

#КонецОбласти 

#Область Прочие_процедуры_и_функции

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(Форма)
	
	Элементы	= Форма.Элементы;
	Запись		= Форма.Запись;	
	
	Элементы.ГруппаРЕПО.Видимость 								= Не Запись.ИспользоватьНастройкиУчетнойПолитикиЕПС;
	Элементы.ТочностьРасчетнойСтавкиРЕПО.Видимость 				= Запись.ВариантРасчетаПроцентовПоСделкамРЕПО = ПредопределенноеЗначение("Перечисление.ВариантыРасчетаПроцентовПоСделкамРЕПО.ПоРасчетнойСтавке");	
	Элементы.КритерийСущественностиОтклоненияССТПлюс.Видимость	= Не Запись.ИспользоватьНастройкиУчетнойПолитикиЕПС;
	
	Элементы.ПриостановленРасчетСЧА.Видимость = Форма.ВидДоговораДоверительногоУправления = ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда");
	
КонецПроцедуры 

&НаСервере
Процедура СчетДоверительногоУправленияПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Запись.СчетДоверительногоУправления) Тогда
		
		ЭтаФорма.ВидДоговораДоверительногоУправления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
					Запись.СчетДоверительногоУправления,
					"ВидДоговораДоверительногоУправления");

		НастроитьВидимостьИДоступность(ЭтаФорма);			
					
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	СчетДоверительногоУправленияПриИзмененииНаСервере();
КонецПроцедуры
	
#КонецОбласти
